fds/src/test/resources/createMessageNoSessionToOde2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<addr:To xmlns:addr="http://www.w3.org/2005/08/addressing">
			http://localhost:8080/ode/processes/workflow/ib4p
		</addr:To>
		<addr:Action
			xmlns:addr="http://www.w3.org/2005/08/addressing">
			createTask
		</addr:Action>
		<addr:ReplyTo
			xmlns:addr="http://www.w3.org/2005/08/addressing">
			<addr:Address>
				http://www.w3.org/2005/08/addressing/anonymous
			</addr:Address>
		</addr:ReplyTo>
		<addr:MessageID
			xmlns:addr="http://www.w3.org/2005/08/addressing">
			uuid:f12e3f25-7292-49f9-96c7-450fdccf8d45-3
		</addr:MessageID>
		<intalio:callback
			xmlns:intalio="http://www.intalio.com/type/session">
			<addr:Address
				xmlns:addr="http://www.w3.org/2005/08/addressing">
				http://localhost:8080/fds/workflow/ib4p
			</addr:Address>
			<intalio:session>
				f12e3f25-7292-49f9-96c7-450fdccf8d45-1
			</intalio:session>
		</intalio:callback>
	</soapenv:Header>
	<soapenv:Body>
		<createTaskRequest xmlns="http://www.intalio.com/bpms/workflow/ib4p_20051115" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
			xmlns:ib4p="http://www.intalio.com/bpms/workflow/ib4p_20051115"> 
			<taskMetaData> 
				<taskId>_gMI6Q24EEd2KMKN1u2djZA</taskId> 
				<taskState /> 
				<taskType /> 
				<description>fitter-AppointmentConfirmation</description> 
				<processId /> 
				<creationDate /> 
				<userOwner>tyredating\patriciasanchezalamo@hotmail.com</userOwner> 
				<roleOwner /> 
				<claimAction> 
					<user /> 
					<role /> 
				</claimAction> 
				<revokeAction> 
					<user /> 
					<role /> 
				</revokeAction> 
				<saveAction> 
					<user /> 
					<role /> 
				</saveAction> 
				<completeAction> 
					<user /> 
					<role /> 
				</completeAction> 
				<formUrl>oxf://TyreCommandDev2/forms/appointment/confirmAppointment.xform</formUrl> 
				<failureCode /> 
				<failureReason /> 
				<priority /> 
				<scheduledActions> 
					<expiration> 
						<until /> 
						<for /> 
					</expiration> 
					<deferActivation> 
						<until /> 
						<for /> 
					</deferActivation> 
				</scheduledActions> 
				<attachments> 
					<attachment> 
						<attachmentMetadata> 
							<mimeType /> 
							<fileName /> 
							<title /> 
							<description>fitter-AppointmentConfirmation</description> 
							<creationDate /> 
						</attachmentMetadata> 
						<payloadUrl /> 
					</attachment> 
				</attachments> 

				<userProcessCompleteSOAPAction>http://ws.tyredating.com/forms/appointment/confirmAppointment/xform/Process/notifyTaskCompletion</userProcessCompleteSOAPAction> 

				<isChainedBefore /> 
				<previousTaskId /> 

				<userProcessEndpoint>http://INTALIO:8080/ode/processes/TyreCommandDev2/processes/CommandeCasPassant/GestionCommande/Centre_de_montage/WFmagic_gMGeAG4EEd2KMKN1u2djZA</userProcessEndpoint> 

				<userProcessNamespaceURI>http://ws.tyredating.com/forms/appointment/confirmAppointment/xform</userProcessNamespaceURI> 
			</taskMetaData> 
			<participantToken /> 
			<taskInput> 
				<input xmlns="http://ws.tyredating.com/forms/appointment/confirmAppointment/xform" 
					xmlns:confirmAppointment="http://ws.tyredating.com/forms/appointment/confirmAppointment/xform"> 
					<orderId>4403</orderId> 
					<processusUuid>e7b942f0-1a64-4024-82fe-4767de9beb98</processusUuid> 
					<expirationDate /> 
				</input> 
			</taskInput> 
		</createTaskRequest>
	</soapenv:Body>
</soapenv:Envelope>
